'''
Задача 4. Список списков
Дан многомерный список:
nice_list = [[[1, 2, 3], [4, 5, 6], [7, 8, 9]], [[10, 11, 12], [13, 14, 15], [16, 17, 18]]]
Напишите код, который раскрывает все вложенные списки, то есть оставляет
лишь внешний список. Для решения используйте только list comprehensions.
'''
nice_list = [[[1, 2, 3], [4, 5, 6], [7, 8, 9]], [[10, 11, 12], [13, 14, 15], [16, 17, 18]]]

ext_list = [digit  for list_level_1 in nice_list for list_level_2 in list_level_1 for digit in list_level_2 ]

print(ext_list)